<template>
  <slot
    name="control"
    :classes="classes.control"
    :open="open"
    :toggle="toggle"
    :on="on"
  />
  <teleport to="body">
    <div
      v-if="open"
      ref="element"
      :class="classes.main"
      :data-status="status"
      :data-window="id"
      @transitionend="onTransition"
    >
      <div :class="classes.body">
        В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
        веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
        молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
        Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
        Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
        Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
        Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
        наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
        для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
        полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
        Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
        Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
        присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
        в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
        современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
        Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
        сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
        «Безверие» (1817)[23].
      </div>
    </div>
  </teleport>
</template>

<script lang="ts">
import { props } from '../../constructors/Window/props'
import { WindowComponent } from './WindowComponent'

export default {
  name: 'Md2Window',
  inheritAttrs: false,
  props,
  setup (props: object, context: object) {
    return new WindowComponent(props, context).setup()
  }
}
</script>

<style lang="scss">
@import '../../constructors/Window/style';

@include initWindow('md2');
</style>
